app/controllers/items_controller.rb

  def set_todo_item
   @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT  "items".* FROM "items" WHERE "items"."todo_id" = $1 AND "items"."id" = $2 LIMIT $3  [["todo_id", 29], ["id", 29], ["LIMIT", 1]]